Constructs a new instance of RadioButtonGroupData.
  Namespace:   Autodesk.Revit.UI
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public RadioButtonGroupData(
	string name
)
  Visual Basic
Public Sub New ( _
	name As String _
)
  Visual C++
public:
RadioButtonGroupData(
	String^ name
)
 Parameters
  name
 Type:  System String
 The internal name of the RadioButtonGroup.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentNullException   |   Thrown when    a null reference (  Nothing  in Visual Basic)  is passed for name.
   Autodesk.Revit.Exceptions ArgumentException   |   Thrown when an empty string is passed for name.
 See Also
  RadioButtonGroupData Class
  Autodesk.Revit.UI Namespace